---
kind: method
id: M:Autodesk.Revit.DB.LeaderArray.ReverseIterator
source: html/fa3afcf9-f8f7-04d8-3631-de9bbb6b3f0a.htm
---
# Autodesk.Revit.DB.LeaderArray.ReverseIterator Method

Retrieve a backward moving iterator to the array.

## Syntax (C#)
```csharp
public virtual LeaderArrayIterator ReverseIterator()
```

## Returns
Returns a backward moving iterator to the array.